alexvatti/embedded-documents/SoC-Validation/firmware/gpu_validation/gpu/gp/m400_gp_F012_FP32_to_UINT8_0_mem_0.c
/* ###################
 * START OF NEW MEMPAGE: 0 */
/* Register 0                                                                       */
/* out_xy_comp 16                                                                   */
/* input0_select 16                                                                 */
/* out_zw_comp 16                                                                   */
/* Adder0                                                                           */
/* adder0_in0 0                                                                     */
/* adder0_in1 22                                                                    */
/* out_x_select 0                                                                   */
/* Adder1                                                                           */
/* adder1_in0 1                                                                     */
/* adder1_in1 22                                                                    */
/* out_y_select 1                                                                   */
/* Mult0                                                                            */
/* mult0_in0 2                                                                      */
/* mult0_in1 22                                                                     */
/* out_z_select 2                                                                   */
/* Mult1                                                                            */
/* mult1_in0 3                                                                      */
/* mult1_in1 22                                                                     */
/* out_w_select 3                                                                   */
/* Register 1                                                                       */
/* out_xy_comp 17                                                                   */
/* input0_select 17                                                                 */
/* out_zw_comp 17                                                                   */
/* Adder0                                                                           */
/* adder0_in0 0                                                                     */
/* adder0_in1 22                                                                    */
/* out_x_select 0                                                                   */
/* Adder1                                                                           */
/* adder1_in0 1                                                                     */
/* adder1_in1 22                                                                    */
/* out_y_select 1                                                                   */
/* Mult0                                                                            */
/* mult0_in0 2                                                                      */
/* mult0_in1 22                                                                     */
/* out_z_select 2                                                                   */
/* Mult1                                                                            */
/* mult1_in0 3                                                                      */
/* mult1_in1 22                                                                     */
/* out_w_select 3                                                                   */
/* Register 2                                                                       */
/* out_xy_comp 18                                                                   */
/* input0_select 18                                                                 */
/* out_zw_comp 18                                                                   */
/* Adder0                                                                           */
/* adder0_in0 0                                                                     */
/* adder0_in1 22                                                                    */
/* out_x_select 0                                                                   */
/* Adder1                                                                           */
/* adder1_in0 1                                                                     */
/* adder1_in1 22                                                                    */
/* out_y_select 1                                                                   */
/* Mult0                                                                            */
/* mult0_in0 2                                                                      */
/* mult0_in1 22                                                                     */
/* out_z_select 2                                                                   */
/* Mult1                                                                            */
/* mult1_in0 3                                                                      */
/* mult1_in1 22                                                                     */
/* out_w_select 3                                                                   */
/* Register 3                                                                       */
/* out_xy_comp 19                                                                   */
/* input0_select 19                                                                 */
/* out_zw_comp 19                                                                   */
/* Adder0                                                                           */
/* adder0_in0 0                                                                     */
/* adder0_in1 22                                                                    */
/* out_x_select 0                                                                   */
/* Adder1                                                                           */
/* adder1_in0 1                                                                     */
/* adder1_in1 22                                                                    */
/* out_y_select 1                                                                   */
/* Mult0                                                                            */
/* mult0_in0 2                                                                      */
/* mult0_in1 22                                                                     */
/* out_z_select 2                                                                   */
/* Mult1                                                                            */
/* mult1_in0 3                                                                      */
/* mult1_in1 22                                                                     */
/* out_w_select 3                                                                   */
/* Register 4                                                                       */
/* out_xy_comp 20                                                                   */
/* input0_select 20                                                                 */
/* out_zw_comp 20                                                                   */
/* Adder0                                                                           */
/* adder0_in0 0                                                                     */
/* adder0_in1 22                                                                    */
/* out_x_select 0                                                                   */
/* Adder1                                                                           */
/* adder1_in0 1                                                                     */
/* adder1_in1 22                                                                    */
/* out_y_select 1                                                                   */
/* Mult0                                                                            */
/* mult0_in0 2                                                                      */
/* mult0_in1 22                                                                     */
/* out_z_select 2                                                                   */
/* Mult1                                                                            */
/* mult1_in0 3                                                                      */
/* mult1_in1 22                                                                     */
/* out_w_select 3                                                                   */
/* Register 5                                                                       */
/* out_xy_comp 21                                                                   */
/* input0_select 21                                                                 */
/* out_zw_comp 21                                                                   */
/* Adder0                                                                           */
/* adder0_in0 0                                                                     */
/* adder0_in1 22                                                                    */
/* out_x_select 0                                                                   */
/* Adder1                                                                           */
/* adder1_in0 1                                                                     */
/* adder1_in1 22                                                                    */
/* out_y_select 1                                                                   */
/* Mult0                                                                            */
/* mult0_in0 2                                                                      */
/* mult0_in1 22                                                                     */
/* out_z_select 2                                                                   */
/* Mult1                                                                            */
/* mult1_in0 3                                                                      */
/* mult1_in1 22                                                                     */
/* out_w_select 3                                                                   */
/* Register 6                                                                       */
/* out_xy_comp 22                                                                   */
/* input0_select 22                                                                 */
/* out_zw_comp 22                                                                   */
/* Adder0                                                                           */
/* adder0_in0 0                                                                     */
/* adder0_in1 22                                                                    */
/* out_x_select 0                                                                   */
/* Adder1                                                                           */
/* adder1_in0 1                                                                     */
/* adder1_in1 22                                                                    */
/* out_y_select 1                                                                   */
/* Mult0                                                                            */
/* mult0_in0 2                                                                      */
/* mult0_in1 22                                                                     */
/* out_z_select 2                                                                   */
/* Mult1                                                                            */
/* mult1_in0 3                                                                      */
/* mult1_in1 22                                                                     */
/* out_w_select 3                                                                   */
/* Register 7                                                                       */
/* out_xy_comp 23                                                                   */
/* input0_select 23                                                                 */
/* out_zw_comp 23                                                                   */
/* Adder0                                                                           */
/* adder0_in0 0                                                                     */
/* adder0_in1 22                                                                    */
/* out_x_select 0                                                                   */
/* Adder1                                                                           */
/* adder1_in0 1                                                                     */
/* adder1_in1 22                                                                    */
/* out_y_select 1                                                                   */
/* Mult0                                                                            */
/* mult0_in0 2                                                                      */
/* mult0_in1 22                                                                     */
/* out_z_select 2                                                                   */
/* Mult1                                                                            */
/* mult1_in0 3                                                                      */
/* mult1_in1 22                                                                     */
/* out_w_select 3                                                                   */
/* Register 8                                                                       */
/* out_xy_comp 24                                                                   */
/* input0_select 24                                                                 */
/* out_zw_comp 24                                                                   */
/* Adder0                                                                           */
/* adder0_in0 0                                                                     */
/* adder0_in1 22                                                                    */
/* out_x_select 0                                                                   */
/* Adder1                                                                           */
/* adder1_in0 1                                                                     */
/* adder1_in1 22                                                                    */
/* out_y_select 1                                                                   */
/* Mult0                                                                            */
/* mult0_in0 2                                                                      */
/* mult0_in1 22                                                                     */
/* out_z_select 2                                                                   */
/* Mult1                                                                            */
/* mult1_in0 3                                                                      */
/* mult1_in1 22                                                                     */
/* out_w_select 3                                                                   */
/* Register 9                                                                       */
/* out_xy_comp 25                                                                   */
/* input0_select 25                                                                 */
/* out_zw_comp 25                                                                   */
/* Adder0                                                                           */
/* adder0_in0 0                                                                     */
/* adder0_in1 22                                                                    */
/* out_x_select 0                                                                   */
/* Adder1                                                                           */
/* adder1_in0 1                                                                     */
/* adder1_in1 22                                                                    */
/* out_y_select 1                                                                   */
/* Mult0                                                                            */
/* mult0_in0 2                                                                      */
/* mult0_in1 22                                                                     */
/* out_z_select 2                                                                   */
/* Mult1                                                                            */
/* mult1_in0 3                                                                      */
/* mult1_in1 22                                                                     */
/* out_w_select 3                                                                   */
/* Register 10                                                                      */
/* out_xy_comp 26                                                                   */
/* input0_select 26                                                                 */
/* out_zw_comp 26                                                                   */
/* Adder0                                                                           */
/* adder0_in0 0                                                                     */
/* adder0_in1 22                                                                    */
/* out_x_select 0                                                                   */
/* Adder1                                                                           */
/* adder1_in0 1                                                                     */
/* adder1_in1 22                                                                    */
/* out_y_select 1                                                                   */
/* Mult0                                                                            */
/* mult0_in0 2                                                                      */
/* mult0_in1 22                                                                     */
/* out_z_select 2                                                                   */
/* Mult1                                                                            */
/* mult1_in0 3                                                                      */
/* mult1_in1 22                                                                     */
/* out_w_select 3                                                                   */
/* Register 11                                                                      */
/* out_xy_comp 27                                                                   */
/* input0_select 27                                                                 */
/* out_zw_comp 27                                                                   */
/* Adder0                                                                           */
/* adder0_in0 0                                                                     */
/* adder0_in1 22                                                                    */
/* out_x_select 0                                                                   */
/* Adder1                                                                           */
/* adder1_in0 1                                                                     */
/* adder1_in1 22                                                                    */
/* out_y_select 1                                                                   */
/* Mult0                                                                            */
/* mult0_in0 2                                                                      */
/* mult0_in1 22                                                                     */
/* out_z_select 2                                                                   */
/* Mult1                                                                            */
/* mult1_in0 3                                                                      */
/* mult1_in1 22                                                                     */
/* out_w_select 3                                                                   */
/* Register 12                                                                      */
/* out_xy_comp 28                                                                   */
/* input0_select 28                                                                 */
/* out_zw_comp 28                                                                   */
/* Adder0                                                                           */
/* adder0_in0 0                                                                     */
/* adder0_in1 22                                                                    */
/* out_x_select 0                                                                   */
/* Adder1                                                                           */
/* adder1_in0 1                                                                     */
/* adder1_in1 22                                                                    */
/* out_y_select 1                                                                   */
/* Mult0                                                                            */
/* mult0_in0 2                                                                      */
/* mult0_in1 22                                                                     */
/* out_z_select 2                                                                   */
/* Mult1                                                                            */
/* mult1_in0 3                                                                      */
/* mult1_in1 22                                                                     */
/* out_w_select 3                                                                   */
/* Register 13                                                                      */
/* out_xy_comp 29                                                                   */
/* input0_select 29                                                                 */
/* out_zw_comp 29                                                                   */
/* Adder0                                                                           */
/* adder0_in0 0                                                                     */
/* adder0_in1 22                                                                    */
/* out_x_select 0                                                                   */
/* Adder1                                                                           */
/* adder1_in0 1                                                                     */
/* adder1_in1 22                                                                    */
/* out_y_select 1                                                                   */
/* Mult0                                                                            */
/* mult0_in0 2                                                                      */
/* mult0_in1 22                                                                     */
